In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                  'key2': ['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

NameError: name 'np' is not defined

In [5]:
import numpy as np

In [6]:
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                  'key2': ['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

In [7]:
df

  key1 key2     data1     data2
0    a  one -0.907020 -0.574474
1    a  two  0.338782  1.228161
2    b  one  0.164542  0.578683
3    b  two -1.355944  0.890174
4    a  one  1.073457 -0.950212

In [8]:
grouped = df['data1'].groupby(df['key1'])

In [9]:
grouped

In [10]:
grouped.mean()

key1
a    0.168406
b   -0.595701
Name: data1, dtype: float64

In [12]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [13]:
means

key1  key2
a     one     0.083218
      two     0.338782
b     one     0.164542
      two    -1.355944
Name: data1, dtype: float64

In [14]:
means.unstack()

key2       one       two
key1
a     0.083218  0.338782
b     0.164542 -1.355944

In [15]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [16]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [17]:
df['data1'].groupby([states, years]).mean()

California  2005    0.338782
            2006    0.164542
Ohio        2005   -1.131482
            2006    1.073457
Name: data1, dtype: float64

In [18]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.168406 -0.098842
b    -0.595701  0.734429

In [19]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.083218 -0.762343
     two   0.338782  1.228161
b    one   0.164542  0.578683
     two  -1.355944  0.890174

In [20]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [21]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.907020 -0.574474
1    a  two  0.338782  1.228161
4    a  one  1.073457 -0.950212
b
  key1 key2     data1     data2
2    b  one  0.164542  0.578683
3    b  two -1.355944  0.890174

In [22]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.907020 -0.574474
4    a  one  1.073457 -0.950212
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.338782  1.228161
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.164542  0.578683
('b', 'two')
  key1 key2     data1     data2
3    b  two -1.355944  0.890174

In [23]:
pieces = dict(list(df.groupby('key1')))

In [24]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.164542  0.578683
3    b  two -1.355944  0.890174

In [25]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [26]:
grouped = df.groupby(df.dtypes, axis=1)

In [27]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.907020 -0.574474
1  0.338782  1.228161
2  0.164542  0.578683
3 -1.355944  0.890174
4  1.073457 -0.950212
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [28]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [29]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.762343
     two   1.228161
b    one   0.578683
     two   0.890174

In [30]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [31]:
s_grouped

In [32]:
s_grouped.mean()

key1  key2
a     one    -0.762343
      two     1.228161
b     one     0.578683
      two     0.890174
Name: data2, dtype: float64

In [33]:
people = pd.DataFrame(np.random.randn(5, 5),
                     columns=['a', 'b', 'c', 'd', 'e'],
                     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [34]:
people.iloc[2:3, [1, 2]] = np.nan

In [35]:
people

               a         b         c         d         e
Joe    -0.610000  0.947670  0.540599 -0.773466 -0.918037
Steve  -0.533089 -0.941265 -0.746704 -0.822666  0.343776
Wes    -0.576155       NaN       NaN  0.688128 -0.615847
Jim     0.057099  0.404261 -0.243361 -0.988751 -0.170234
Travis -0.753925  1.954144 -0.771623  0.788879 -0.597195

In [36]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [37]:
by_column = people.groupby(mapping, axis=1)

In [38]:
by_column.sum()

            blue       red
Joe    -0.232868 -0.580367
Steve  -1.569370 -1.130578
Wes     0.688128 -1.192002
Jim    -1.232112  0.291127
Travis  0.017256  0.603024

In [39]:
map_series = pd.Series(mapping)

In [40]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [41]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [42]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.129056  1.351932  0.297238 -1.074089 -1.704118
5 -0.533089 -0.941265 -0.746704 -0.822666  0.343776
6 -0.753925  1.954144 -0.771623  0.788879 -0.597195

In [43]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [44]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.610000  0.947670  0.540599 -0.773466 -0.918037
  two  0.057099  0.404261 -0.243361 -0.988751 -0.170234
5 one -0.533089 -0.941265 -0.746704 -0.822666  0.343776
6 two -0.753925  1.954144 -0.771623  0.788879 -0.597195

In [45]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [46]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [47]:
hier_df

city         US                            JP
tenor         1         3         5         1         3
0      0.213123  0.636733 -0.834790  1.942782  0.200953
1      0.580569  1.027102  0.701122  1.403885 -0.543446
2     -0.104993 -0.319112  0.153233 -1.087530  1.367872
3      0.492588  0.871445 -0.576496  0.220312 -0.940522

In [51]:
hier_df.groupby(level='city', axis=1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

In [53]:
hier_df.groupby(level='city', axis=1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

In [54]:
df

  key1 key2     data1     data2
0    a  one -0.907020 -0.574474
1    a  two  0.338782  1.228161
2    b  one  0.164542  0.578683
3    b  two -1.355944  0.890174
4    a  one  1.073457 -0.950212

In [55]:
grouped = df.groupby('key1')

In [57]:
grouped['data1'].quantile(0.9)

key1
a    0.926522
b    0.012493
Name: data1, dtype: float64

In [58]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [59]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.980477  2.178373
b     1.520486  0.311491

In [60]:
grouped.describe()

     data1                                                             \
     count      mean       std       min       25%       50%      75%
key1
a      3.0  0.168406  1.001171 -0.907020 -0.284119  0.338782  0.70612
b      2.0 -0.595701  1.075146 -1.355944 -0.975823 -0.595701 -0.21558

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.073457   3.0 -0.098842  1.164473 -0.950212 -0.762343 -0.574474
b     0.164542   2.0  0.734429  0.220257  0.578683  0.656556  0.734429


           75%       max
key1
a     0.326843  1.228161
b     0.812301  0.890174

In [62]:
tips = pd.read_csv('examples/tips.csv')

In [63]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [64]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [65]:
grouped_pct = grouped['tip_pct']

KeyError: 'Column not found: tip_pct'

In [66]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [67]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [68]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [69]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [70]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [71]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [72]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [73]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [74]:
f = lambda x: x.describe()
grouped.apply(f)

               data1     data2
key1
a    count  3.000000  3.000000
     mean   0.168406 -0.098842
     std    1.001171  1.164473
     min   -0.907020 -0.950212
     25%   -0.284119 -0.762343
     50%    0.338782 -0.574474
     75%    0.706120  0.326843
     max    1.073457  1.228161
b    count  2.000000  2.000000
     mean  -0.595701  0.734429
     std    1.075146  0.220257
     min   -1.355944  0.578683
     25%   -0.975823  0.656556
     50%   -0.595701  0.734429
     75%   -0.215580  0.812301
     max    0.164542  0.890174

In [75]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [76]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                     'data2': np.random.randn(1000)})

In [77]:
quartiles = pd.cut(frame.data1, 4)

In [78]:
quartiles[:10]

0    (-1.773, -0.142]
1    (-1.773, -0.142]
2     (-0.142, 1.488]
3    (-1.773, -0.142]
4     (-0.142, 1.488]
5    (-1.773, -0.142]
6    (-1.773, -0.142]
7     (-0.142, 1.488]
8     (-0.142, 1.488]
9      (1.488, 3.118]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.409, -1.773] < (-1.773, -0.142] < (-0.142, 1.488] < (1.488, 3.118]]

In [79]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
           'count': group.count(), 'mean': group.mean()}

In [80]:
grouped = frame.data2.groupby(quartiles)

In [81]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.409, -1.773]   40.0  1.308029 -0.679694 -2.666852
(-1.773, -0.142]  425.0  2.607758 -0.111213 -3.206210
(-0.142, 1.488]   456.0  3.310283  0.060141 -3.196888
(1.488, 3.118]     79.0  2.266115 -0.048740 -2.443428

In [82]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [83]:
grouped = frame.data2.groupby(grouping)

In [84]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.607758 -0.358114 -2.666852
1      100.0  2.593100 -0.092872 -2.725591
2      100.0  1.897075 -0.094255 -2.738878
3      100.0  2.064860 -0.201435 -3.206210
4      100.0  2.504586  0.005136 -3.196888
5      100.0  2.765767  0.070809 -2.843860
6      100.0  2.577765  0.061384 -2.439183
7      100.0  1.725573 -0.007161 -2.076957
8      100.0  3.310283  0.010821 -2.360329
9      100.0  2.559848  0.096890 -2.443428

In [85]:
s = pd.Series(np.random.randn(6))

In [86]:
s[::2] = np.nan

In [87]:
s

0         NaN
1    2.189399
2         NaN
3    0.733860
4         NaN
5    0.120511
dtype: float64

In [88]:
s.fillna(s.mean())

0    1.014590
1    2.189399
2    1.014590
3    0.733860
4    1.014590
5    0.120511
dtype: float64

In [92]:
states = ['Ohio', 'NewYork', 'Vermont', 'Florida', 'Oregon', 'Nevada', 'California', 'Idaho']

In [93]:
group_key = ['East'] * 4 + ['West'] * 4

In [94]:
data = pd.Series(np.random.randn(8), index=states)

In [95]:
data

Ohio         -1.919050
NewYork      -0.189615
Vermont      -2.353212
Florida      -1.616067
Oregon        0.385826
Nevada       -0.485490
California    0.222000
Idaho         2.108452
dtype: float64

In [96]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [97]:
data

Ohio         -1.919050
NewYork      -0.189615
Vermont            NaN
Florida      -1.616067
Oregon        0.385826
Nevada             NaN
California    0.222000
Idaho              NaN
dtype: float64

In [98]:
data.groupby(group_key).mean()

East   -1.241578
West    0.303913
dtype: float64

In [99]:
fill_mean = lambda g: g.fillna(g.mean())

In [100]:
data.groupby(group_key).apply(fill_mean)

Ohio         -1.919050
NewYork      -0.189615
Vermont      -1.241578
Florida      -1.616067
Oregon        0.385826
Nevada        0.303913
California    0.222000
Idaho         0.303913
dtype: float64

In [101]:
fill_values = {'East': 0.5, 'West': -1}

In [102]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [103]:
data.groupby(group_key).apply(fill_func)

Ohio         -1.919050
NewYork      -0.189615
Vermont       0.500000
Florida      -1.616067
Oregon        0.385826
Nevada       -1.000000
California    0.222000
Idaho        -1.000000
dtype: float64

In [104]:
suits = ['H', 'S', 'C', 'D']

In [105]:
card_val = (list(range(1, 11)) + [10] * 3) * 4

In [106]:
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']

In [107]:
cards = []

In [108]:
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [109]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [110]:
def draw(deck, n=5):
    return deck.sample(n)
draw(deck)

2S     2
9D     9
3S     3
QH    10
4H     4
dtype: int64

In [111]:
get_suit = lambda card: card[-1]

In [112]:
deck.groupby(get_suit).apply(draw, n=2)

C  QC    10
   3C     3
D  5D     5
   AD     1
H  2H     2
   3H     3
S  9S     9
   8S     8
dtype: int64

In [113]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

4C     4
5C     5
7D     7
AD     1
3H     3
QH    10
8S     8
AS     1
dtype: int64

In [114]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
                  'data': np.random.randn(8),
                  'weights': np.random.rand(8)})

In [115]:
df

  category      data   weights
0        a -1.481406  0.666237
1        a  0.779655  0.390052
2        a -0.830438  0.774206
3        a -0.732462  0.554101
4        b  0.937566  0.222736
5        b -0.363355  0.584964
6        b  0.063450  0.079150
7        b -0.393455  0.344789

In [116]:
grouped = df.groupby('category')

In [117]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [118]:
grouped.apply(get_wavg)

category
a   -0.726182
b   -0.109087
dtype: float64

In [119]:
close_px = pd.read_csv('examples/stock_px_2.csv',
                      parse_dates=True, index_col=0)

In [120]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [121]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [122]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [123]:
rets = close_px.pct_change().dropna()

In [124]:
get_year = lambda x: x.year

In [125]:
by_year = rets.groupby(get_year)

In [126]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [127]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [128]:
import statsmodels.api as sm

In [129]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1
    result = sm.OLS(Y, X).fit()
    return result.params

In [130]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [131]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [132]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [133]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [134]:
tips.pivot_table('tip_pct', index=['time', 'smoker'],
                columns='day', aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [135]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                columns='day', aggfunc='mean', fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [136]:
data

Ohio         -1.919050
NewYork      -0.189615
Vermont            NaN
Florida      -1.616067
Oregon        0.385826
Nevada             NaN
California    0.222000
Idaho              NaN
dtype: float64

In [137]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

AttributeError: 'Series' object has no attribute 'Nationality'

In [138]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244